#+TITLE: Introduction to elipsp
#+CATEGORY: elisp

- Ce document donne des détails sur l'implémentation de fonctions d'usage courant.
- Peut être utilisé pour révoir l'implémentation des hyperliens.
- Par exemple gestion des hyperliens selon "type" (mp3/pdf).
** FAIRE [[info:eintr#Buffer%20Exercises][Exercice 4.6 (fin du chapitre 4.0)]]
   SCHEDULED: <2015-01-28 mer.>
   :PROPERTIES:
   :ID:       49481c3f-82f8-4f0b-8761-e5cfae535a45
   :END:
   #+begin_src elisp
     (defun simplified-end-of-buffer()
       (interactive)
       (goto-char (point-max)))
   #+end_src

   #+RESULTS:
   : simplified-end-of-buffer

   #+begin_src elisp
     (defun exo/test-buffer(buffer)
       "Affiche le message 'existe' si le buffer indiqué existe et 'non existant' sinon"
       (interactive "B")
       (if (get-buffer buffer)
	   (message "existe")
	   (message "non existant")))   
   #+end_src

   Pour utiliser la fonction find-tag, on commencer par créer le fichier TAG par
   #+begin_src sh 
   etags /usr/share/emacs/24.4/lisp/*
   #+end_src

   #+RESULTS:
   puis on précise le ficher de TAG à utiliser

   #+begin_src elisp
   (setq tags-file-name "~/org/projets/autoformation/TAGS")
   #+end_src

   #+RESULTS:
   : ~/org/projets/autoformation/TAGS
   et finalement, utilise *find-tag* (en mode interactif).
